app/Models/ModelLokasi.php

    public function insertData($data)
    {
        $this->db->table('tbl_lokasi')->insert($data);
---
INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('les zahhra', 'lubuk basung', '-0.3049961329068215', '100.36948387519095', '1779251381_4b5ba31deca7c7e28903.png')

    public function getAllData()
    {
        return $this->db->table('tbl_lokasi')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_lokasi`

    public function deleteData($data)
    {
        $this->db->table('tbl_lokasi')
        ->where('id_lokasi',$data['id_lokasi'])
        ->delete($data);
---
DELETE FROM `tbl_lokasi`
WHERE `id_lokasi` = '3'
AND `id_lokasi` = '3'